In [1]:
import pandas as pd
import numpy as np

In [2]:
my_array = np.array([[0, 1, 2, 3], [4, 5, 6, 7]])
df = pd.DataFrame(my_array)
df

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [3]:
df.columns = ['first',' second', 'third', 'last']
df.index = ['first name', "last name"]
df

            first   second  third  last
first name      0        1      2     3
last name       4        5      6     7

In [4]:
df2 = pd.DataFrame(
    my_array,
    columns=["first", "second", "third", "last"],
    index=['first name', 'last name'])
df2

            first  second  third  last
first name      0       1      2     3
last name       4       5      6     7

In [8]:
names = ['Inna', 'Will', 'Sasha', 'Alex', 'Olga', 'Zhenya', 'Yura']

purchases = pd.DataFrame(index=names)
purchases['country'] = ['US', 'CAN', 'Russia', 'Ukraine', 'US', 'Ukraine', 'Russia']
purchases['ad_views'] = [16, 42, 12, 10, 5, 7, 15]
purchases['items_purchased'] = [2, 1, 0, 1, 2, 0, 1]
purchases

        country  ad_views  items_purchased
Inna         US        16                2
Will        CAN        42                1
Sasha    Russia        12                0
Alex    Ukraine        10                1
Olga         US         5                2
Zhenya  Ukraine         7                0
Yura     Russia        15                1

In [15]:
purchases.country

Inna           US
Will          CAN
Sasha      Russia
Alex      Ukraine
Olga           US
Zhenya    Ukraine
Yura       Russia
Name: country, dtype: object

In [16]:
purchases['items_purch_per ad'] = purchases['items_purchased'] / purchases['ad_views']
purchases

        country  ad_views  items_purchased  items_purch_per ad
Inna         US        16                2            0.125000
Will        CAN        42                1            0.023810
Sasha    Russia        12                0            0.000000
Alex    Ukraine        10                1            0.100000
Olga         US         5                2            0.400000
Zhenya  Ukraine         7                0            0.000000
Yura     Russia        15                1            0.066667

In [17]:
purchases['items_purchased'] / purchases['ad_views']

Inna      0.125000
Will      0.023810
Sasha     0.000000
Alex      0.100000
Olga      0.400000
Zhenya    0.000000
Yura      0.066667
dtype: float64

In [18]:
purchases.loc['Inna']

country                  US
ad_views                 16
items_purchased           2
items_purch_per ad    0.125
Name: Inna, dtype: object

In [19]:
purchases.loc[:,'country']

Inna           US
Will          CAN
Sasha      Russia
Alex      Ukraine
Olga           US
Zhenya    Ukraine
Yura       Russia
Name: country, dtype: object

In [20]:
purchases.loc['Inna', 'country']

'US'

In [21]:
purchases.iloc[1:3, 1]

Will     42
Sasha    12
Name: ad_views, dtype: int64

In [23]:
purchases.loc[lambda df: purchases['items_purchased'] >1, :]

     country  ad_views  items_purchased  items_purch_per ad
Inna      US        16                2               0.125
Olga      US         5                2               0.400

In [24]:
purchases[purchases['items_purchased'] > 1]

     country  ad_views  items_purchased  items_purch_per ad
Inna      US        16                2               0.125
Olga      US         5                2               0.400

In [25]:
purchases.groupby('country')

In [28]:
purchases.groupby('country')['ad_views', 'items_purchased'].mean()

         ad_views  items_purchased
country
CAN          42.0              1.0
Russia       13.5              0.5
US           10.5              2.0
Ukraine       8.5              0.5

In [31]:
df.to_csv('C:\Inna\'s files\data\practice.csv')